In [ ]:
============= EDA ==============
1. pandas : data frame applications
2. numpy : numerical python all math applications
3. matplotlib : used for plotting
4. seaborn : used for plot
5. plotly : used for plot
6. bokhe : plot
    
============ machine learning ===========
7. sickit-learn : sklearn

============ deep learning =============
8. tensorflow : google
9. keras : google
10. pytorch : facebook

============ NLP ============
11. NLTK : natural language tool kit
12. scipy 

============ BERT ===========
13. transformers : hugging face(google)

============ google models ==========
14. specific google packages 

============ azure ML ===========
15. azure packages 

=========== GenAI ==========
16. gemini ai : google
17. chatgpt : openai
    
=========== langchain =========
18. langchain packages

**create a dataframe using list**

In [ ]:
- list === dictionary
- dictionary === list

**step-1**


**create empty dataframe**

In [1]:
import pandas as pd
names=['ayush','avinash','akash']
pd.DataFrame()   # empty dataframe no rows and no columns

Empty DataFrame
Columns: []
Index: []

**step-2**

**provide the data**

In [2]:
names=['ayush','avinash','akash']
pd.DataFrame(names)

         0
0    ayush
1  avinash
2    akash

In [4]:
names=['ayush','avinash','akash']
age=[25,30,35]
pd.DataFrame(zip(names,age))

# what is the first positional argument : data
# second positional argument : index

         0   1
0    ayush  25
1  avinash  30
2    akash  35

In [5]:
names=['ayush','avinash','akash']
age=[25,30,35]
city=['hyd','blr','chennai']
data=zip(names,age)
pd.DataFrame(data,city)

               0   1
hyd        ayush  25
blr      avinash  30
chennai    akash  35

**step-3**


**provide the column names**

In [6]:
names=['ayush','avinash','akash']
age=[25,30,35]
pd.DataFrame(zip(names,age),columns=['names','age'])

     names  age
0    ayush   25
1  avinash   30
2    akash   35

In [7]:
names=['ayush','avinash','akash']
age=[25,30,35]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['name','age','city']
pd.DataFrame(data,columns=cols)

      name  age     city
0    ayush   25      hyd
1  avinash   30      blr
2    akash   35  chennai

In [8]:
names=['ayush','avinash','akash']
age=[25,30,35]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['name','age','city']
df=pd.DataFrame(data,columns=cols)

In [9]:
type(df)

pandas.core.frame.DataFrame

**step-4**

**add new column**

- if you want to add new column
- first you need to check the number of rows in already existed data
- for example in above the dataframes has 3 rows
- you need to create a new list with 3 rows
- that list equate to the dataframe

In [13]:
job=['DS','DE','CS']
df['JOB']=job
df

      name  age     city JOB
0    ayush   25      hyd  DS
1  avinash   30      blr  DE
2    akash   35  chennai  CS

**step-5**

**update the already existed column**

- create new column and update new column

In [17]:
df['age']=[35,40,45]
df

      name  age     city JOB
0    ayush   35      hyd  DS
1  avinash   40      blr  DE
2    akash   45  chennai  CS

**step-6**

**change the index**

In [24]:
import pandas as pd
names=['ayush','avinash','akash','anvi']
age=[25,30,35]
city=['hyd','blr','chennai','mumbai']

data=zip(names,age,city)
cols=['name','age','city']
idx=['a','b','c','d']
df=pd.DataFrame(data,index=idx,columns=cols)
df

ValueError: Length of values (3) does not match length of index (4)

**note**

- number of list equals to **number of columns**
- number of values inside list equals to **number of rows**
- when you create the data

**step-7**

**shape**

- no of rows
- no of columns

In [26]:
df.shape
# matrix format
# 4 rows and 3 columns
print("the number of rows are:",df.shape[0])
print("the number of columns are:",df.shape[1])

the number of rows are: 3
the number of columns are: 3

**step-8**

**drop the column**

- in order to drop column we required 3 arguments

- coolumn name

  - the column name we need to mention
    
- axis

  - axis=0 **represents rows**
    
  - axis=1 **represents columns**

- inplace

  - we are drop column means we are modifying the data frame
    
  - so this modifications we want to save in same varriable or different variable

  - if you want to keep in the same variable the **inplace=True**

In [27]:
df

      name  age     city
a    ayush   25      hyd
b  avinash   30      blr
c    akash   35  chennai

In [28]:
df.drop('city',
        axis=1,
        inplace=True)

In [29]:
df

      name  age
a    ayush   25
b  avinash   30
c    akash   35

In [31]:
df.drop('age',
        axis=1)  # do not give inplace=True

      name
a    ayush
b  avinash
c    akash

**step-9**

**multiple columns drop**

In [34]:
import pandas as pd
names=['ayush','avinash','akash']
age=[25,30,35]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['name','age','city']
idx=['a','b','c']
df=pd.DataFrame(data,index=idx,columns=cols)
df

      name  age     city
a    ayush   25      hyd
b  avinash   30      blr
c    akash   35  chennai

In [ ]:
df.drop(['age','city']),axis=1,inplace=True

In [38]:
df

      name  age     city
a    ayush   25      hyd
b  avinash   30      blr
c    akash   35  chennai

In [ ]:
df.drop('a',axis=1,inplace=True)

In [39]:
df

      name  age     city
a    ayush   25      hyd
b  avinash   30      blr
c    akash   35  chennai

**step-11**

**how to save the data frame**

- generally data frames are two types

- csv (comma seperated value)

- excel

In [41]:
# file name = data
# extention = .csv
df.to_csv('data.csv')

In [43]:
df.to_excel('data.xlsx')